<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of Floorp and imports into Munki.</string>
        <key>Identifier</key>
        <string>com.github.haircut.munki.Floorp</string>
        <key>ParentRecipe</key>
        <string>com.github.haircut.download.Floorp</string>
        <key>Input</key>
        <dict>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>apps/Ablaze</string>
            <key>NAME</key>
            <string>Floorp</string>
            <key>pathname</key>
            <string>%pathname%</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>description</key>
                <string>Floorp is a new Firefox based browser from Japan with excellent privacy &amp; flexibility.</string>
                <key>developer</key>
                <string>Ablaze</string>
                <key>display_name</key>
                <string>Floorp</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>unattended_install</key>
                <true/>
                <key>unattended_uninstall</key>
                <true/>
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>2.3</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%pathname%</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
