<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Hudl Sportscode disk image.</string>
    <key>Identifier</key>
    <string>com.github.haircut.download.HudlSportscode</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>HudlSportscode</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>This set of recipes has been moved to primalcurve-recipes. Please update your recipe list and overrides accordingly.</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
