<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest SportsCode disk image.</string>
    <key>Identifier</key>
    <string>com.github.haircut.download.SportsCode</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>SportsCode</string>
        <key>DOWNLOAD_URL</key>
        <string>https://www.hudl.com/downloads/elite</string>
        <key>USER_AGENT</key>
        <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_3) AppleWebKit/536.28.10 (KHTML, like Gecko) Version/6.0.3 Safari/536.28.10</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>This set of recipes has been moved to primalcurve-recipes. Please update your recipe list and overrides accordingly.</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
