<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest the Poll Everywhere disk image and creates a versioned package.</string>
    <key>Identifier</key>
    <string>com.github.haircut.pkg.PollEverywhereApp</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>PollEverywhere</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.haircut.download.PollEverywhereApp</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Comment</key>
            <string>Added 2018-08-24 - App bundle in 2.17.0 release does not contain CFBundleShortVersionString key. Using CFBundleVersion instead.</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%pathname%/Poll Everywhere.app/Contents/Info.plist</string>
                <key>plist_version_key</key>
                <string>CFBundleVersion</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>AppPkgCreator</string>
        </dict>
    </array>
</dict>
</plist>