<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Descript.

Valid values for ARCH include:
- "x86_64" (default, Intel)
- "arm64" (Apple Silicon)

The only verified PLATFORM value is "mac".
</string>
	<key>Identifier</key>
	<string>com.github.haircut.download.Descript</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Descript</string>
		<key>ARCH</key>
		<string>x86_64</string>
		<key>PLATFORM</key>
		<string>mac</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>https://web.descript.com/download?platform=%PLATFORM%&amp;arch=%ARCH%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Descript.app</string>
				<key>requirement</key>
				<string>identifier "com.descript.beachcube" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = D4CJQGP2T7</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
