<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest PreForm disk image.</string>
    <key>Identifier</key>
    <string>com.github.haircut.download.PreForm</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>PreForm</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://formlabs.com/tools/preform/</string>
                <key>re_pattern</key>
                <string>&lt;h1&gt;PreForm Software &lt;small&gt;(.*?)&lt;/small&gt;</string>
                <key>result_output_var_name</key>
                <string>version</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://formlabs.com/tools/preform/</string>
                <key>re_pattern</key>
                <string>href="(https://s3.amazonaws.com/FormlabsReleases/Release/.*?/PreForm_.*?_release_origin_release_.*?.dmg)"</string>
                <key>result_output_var_name</key>
                <string>dmg_url</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%dmg_url%</string>
                <key>filename</key>
                <string>%NAME%-%version%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>