<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest PreForm disk image.</string>
    <key>Identifier</key>
    <string>com.github.haircut.download.PreForm</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>PreForm</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>\"location\":\"(https://s3\.amazonaws\.com/FormlabsReleases/Release/.*/PreForm_mac_.*_release_releaser_42_6945\.dmg)\"},\"__APOLLO_STATE__</string>
                <key>result_output_var_name</key>
                <string>match</string>
                <key>url</key>
                <string>https://formlabs.com/download-preform-mac/</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%match%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/PreForm.app</string>
                <key>requirement</key>
                <string>identifier "com.formlabs.PreForm" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = KVPE3R79SR</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>