<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest CADET disk image.</string>
    <key>Identifier</key>
    <string>com.github.haircut.download.CADET</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>CADET</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://ncamftp.wgbh.org/cadet/downloads.html</string>
                <key>re_pattern</key>
                <string>href="(http://ncamftp.wgbh.org/cadet/cadet-setup-.*?.dmg)"&gt;Mac installer</string>
                <key>result_output_var_name</key>
                <string>dmg_url</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%dmg_url%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/CADET.app</string>
                <key>requirements</key>
                <string>identifier "org.wgbh.ncam.cadet" and anchor apple generic and certificate leaf[subject.CN] = "Mac Developer: Bradley Botkin (E9484PTCU6)" and certificate 1[field.1.2.840.113635.100.6.2.1] /* exists */</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
