<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of cura (lulzbot edition) and creates a package.</string>
    <key>Identifier</key>
    <string>com.github.haircut.pkg.cura-lulzbot</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>cura-lulzbot</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.w0.download.cura-lulzbot</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>AppPkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>app_path</key>
                <string>%pathname%/*.app</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>