<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest VDMX5 disk image, extract the contained package, and names it with the correct version.</string>
	<key>Identifier</key>
	<string>com.github.haircut.pkg.VDMX5</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>VDMX5</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.haircut.download.VDMX5</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/expanded</string>
				<key>flat_pkg_path</key>
				<string>%pathname%/VDMX5 Installer*.pkg</string>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/expanded/VDMX5_Installer.pkg/Payload</string>
			</dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/Applications/VDMX5.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleVersion</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				<key>source_pkg</key>
				<string>%pathname%/VDMX5 Installer*.pkg</string>
			</dict>
			<key>Processor</key>
			<string>PkgCopier</string>
		</dict>
	</array>
</dict>
</plist>
