<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest the MakeMKV disk image and creates a versioned package.</string>
    <key>Identifier</key>
    <string>com.github.haircut.pkg.MakeMKV</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MakeMKV</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.apizz.download.MakeMKV</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>AppPkgCreator</string>
        </dict>
    </array>
</dict>
</plist>