<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest the Scribus disk image and creates a versioned package.</string>
    <key>Identifier</key>
    <string>com.github.haircut.pkg.Scribus</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Scribus</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.hansen-m.download.Scribus</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>AppPkgCreator</string>
            <key>Comment</key>
            <string>The Scribus.app Info.plist CFBundleShortVersion string contains the sequence '.svn' which will cause an 
'Invalid version component error' with autopkgserver. To avoid this we simply trust the version number passed on from the 
parent download recipe instead of using AppDmgVersioner.</string>
        </dict>
    </array>
</dict>
</plist>