<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest the PyMOL disk image and builds a package.</string>
    <key>Identifier</key>
    <string>com.github.haircut.pkg.PyMOL</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>PyMOL</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.its-unibas.download.PyMOL</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%pathname%/PyMOL.app/Contents/Info.plist</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>AppPkgCreator</string>
        </dict>
    </array>
</dict>
</plist>