<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Copies the versioned Cloudflare WARP package to the recipe cache directory, if a new verison was downloaded.</string>
        <key>Identifier</key>
        <string>com.github.haircut.pkg.CloudflareWARPTeams</string>
        <key>ParentRecipe</key>
        <string>com.github.haircut.download.CloudflareWARPTeams</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Cloudflare WARP</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.0.0</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>StopProcessingIf</string>
                <key>Arguments</key>
                <dict>
                    <key>predicate</key>
                    <string>download_changed == False</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PkgCopier</string>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
                    <key>source_pkg</key>
                    <string>%pathname%</string>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
