<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of Cloudflare WARP for teams from the Cloudflare AppCenter feed. This release is intended for organizations using WARP for Teams and is typically newer than the public 1.1.1.1 release.</string>
        <key>Identifier</key>
        <string>com.github.haircut.download.CloudflareWARPTeams</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Cloudflare WARP</string>
            <key>SPARKLE_FEED_URL</key>
            <string>https://api.appcenter.ms/v0.1/public/sparkle/apps/87d9992a-351c-44a9-849b-3f9a89d63d18</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.0.0</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>SparkleUpdateInfoProvider</string>
                <key>Arguments</key>
                <dict>
                    <key>appcast_url</key>
                    <string>%SPARKLE_FEED_URL%</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>URLDownloader</string>
                <key>Arguments</key>
                <dict>
                    <key>filename</key>
                    <string>%NAME%-%version%.pkg</string>
                    <key>url</key>
                    <string>%url%</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
                <key>Arguments</key>
                <dict>
                    <key>expected_authority_names</key>
                    <array>
                        <string>Developer ID Installer: Cloudflare Inc. (68WVV388M8)</string>
                        <string>Developer ID Certification Authority</string>
                        <string>Apple Root CA</string>
                    </array>
                    <key>input_path</key>
                    <string>%pathname%</string>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
