<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download latest avidemux dmg. Permission has been granted by FOSSHub to automate downloads of this project. Specifically:

        > If you download a single copy and plan to duplicate that file (inside your internal network) for over a thousand systems or a million, you have our permission.
        > If you wish to download a file or the same file a thousand times then no, you do not have our permission as this would abuse our service.</string>
    <key>Identifier</key>
    <string>com.github.haircut.download.avidemux</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>avidemux</string>
        <key>SEARCH_URL</key>
        <string>http://www.fosshub.com/Avidemux.html</string>
        <key>SEARCH_PATTERN</key>
        <string>\/Avidemux.html.(Avidemux_([0-9].[0-9].[0-9])_Sierra_64Bits_Qt5)\.dmg</string>
        <key>SEARCH_PATTERN2</key>
        <string>(https.*\.dmg)</string>
        <key>USER_AGENT</key>
        <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_3) AppleWebKit/536.28.10 (KHTML, like Gecko) Version/6.0.3 Safari/536.28.10</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://www.fosshub.com/Avidemux.html</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://www.fosshub.com/Avidemux.html/%match%.dmg</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN2%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%match%</string>
                 <key>request_headers</key>
                    <dict>
                            <key>user-agent</key>
                            <string>%USER_AGENT%</string>
                            <key>Referer</key>
                            <string>https://www.fosshub.com/Avidemux.html</string>
                    </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>